{
  "weight_map": {
    "transformer.blocks.0.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.0.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.0.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.0.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.0.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.0.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.0.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.0.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.0.norm_1.bias": "model.safetensors",
    "transformer.blocks.0.norm_1.weight": "model.safetensors",
    "transformer.blocks.0.norm_2.bias": "model.safetensors",
    "transformer.blocks.0.norm_2.weight": "model.safetensors",
    "transformer.blocks.1.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.1.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.1.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.1.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.1.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.1.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.1.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.1.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.1.norm_1.bias": "model.safetensors",
    "transformer.blocks.1.norm_1.weight": "model.safetensors",
    "transformer.blocks.1.norm_2.bias": "model.safetensors",
    "transformer.blocks.1.norm_2.weight": "model.safetensors",
    "transformer.blocks.10.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.10.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.10.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.10.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.10.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.10.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.10.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.10.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.10.norm_1.bias": "model.safetensors",
    "transformer.blocks.10.norm_1.weight": "model.safetensors",
    "transformer.blocks.10.norm_2.bias": "model.safetensors",
    "transformer.blocks.10.norm_2.weight": "model.safetensors",
    "transformer.blocks.11.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.11.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.11.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.11.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.11.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.11.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.11.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.11.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.11.norm_1.bias": "model.safetensors",
    "transformer.blocks.11.norm_1.weight": "model.safetensors",
    "transformer.blocks.11.norm_2.bias": "model.safetensors",
    "transformer.blocks.11.norm_2.weight": "model.safetensors",
    "transformer.blocks.2.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.2.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.2.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.2.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.2.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.2.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.2.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.2.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.2.norm_1.bias": "model.safetensors",
    "transformer.blocks.2.norm_1.weight": "model.safetensors",
    "transformer.blocks.2.norm_2.bias": "model.safetensors",
    "transformer.blocks.2.norm_2.weight": "model.safetensors",
    "transformer.blocks.3.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.3.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.3.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.3.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.3.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.3.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.3.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.3.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.3.norm_1.bias": "model.safetensors",
    "transformer.blocks.3.norm_1.weight": "model.safetensors",
    "transformer.blocks.3.norm_2.bias": "model.safetensors",
    "transformer.blocks.3.norm_2.weight": "model.safetensors",
    "transformer.blocks.4.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.4.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.4.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.4.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.4.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.4.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.4.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.4.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.4.norm_1.bias": "model.safetensors",
    "transformer.blocks.4.norm_1.weight": "model.safetensors",
    "transformer.blocks.4.norm_2.bias": "model.safetensors",
    "transformer.blocks.4.norm_2.weight": "model.safetensors",
    "transformer.blocks.5.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.5.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.5.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.5.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.5.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.5.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.5.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.5.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.5.norm_1.bias": "model.safetensors",
    "transformer.blocks.5.norm_1.weight": "model.safetensors",
    "transformer.blocks.5.norm_2.bias": "model.safetensors",
    "transformer.blocks.5.norm_2.weight": "model.safetensors",
    "transformer.blocks.6.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.6.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.6.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.6.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.6.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.6.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.6.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.6.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.6.norm_1.bias": "model.safetensors",
    "transformer.blocks.6.norm_1.weight": "model.safetensors",
    "transformer.blocks.6.norm_2.bias": "model.safetensors",
    "transformer.blocks.6.norm_2.weight": "model.safetensors",
    "transformer.blocks.7.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.7.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.7.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.7.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.7.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.7.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.7.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.7.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.7.norm_1.bias": "model.safetensors",
    "transformer.blocks.7.norm_1.weight": "model.safetensors",
    "transformer.blocks.7.norm_2.bias": "model.safetensors",
    "transformer.blocks.7.norm_2.weight": "model.safetensors",
    "transformer.blocks.8.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.8.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.8.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.8.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.8.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.8.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.8.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.8.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.8.norm_1.bias": "model.safetensors",
    "transformer.blocks.8.norm_1.weight": "model.safetensors",
    "transformer.blocks.8.norm_2.bias": "model.safetensors",
    "transformer.blocks.8.norm_2.weight": "model.safetensors",
    "transformer.blocks.9.attn.Wqkv.bias": "model.safetensors",
    "transformer.blocks.9.attn.Wqkv.weight": "model.safetensors",
    "transformer.blocks.9.attn.out_proj.bias": "model.safetensors",
    "transformer.blocks.9.attn.out_proj.weight": "model.safetensors",
    "transformer.blocks.9.ffn.down_proj.bias": "model.safetensors",
    "transformer.blocks.9.ffn.down_proj.weight": "model.safetensors",
    "transformer.blocks.9.ffn.up_proj.bias": "model.safetensors",
    "transformer.blocks.9.ffn.up_proj.weight": "model.safetensors",
    "transformer.blocks.9.norm_1.bias": "model.safetensors",
    "transformer.blocks.9.norm_1.weight": "model.safetensors",
    "transformer.blocks.9.norm_2.bias": "model.safetensors",
    "transformer.blocks.9.norm_2.weight": "model.safetensors",
    "transformer.norm_f.bias": "model.safetensors",
    "transformer.norm_f.weight": "model.safetensors",
    "transformer.wpe.weight": "model.safetensors",
    "transformer.wte.weight": "model.safetensors"
  }
}